{
  "backend/main.mo": "Main Motoko actor defining types (StudentProfile, Course, Enrollment, UserProfile) and CRUD operations for student, course, and enrollment management with role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report documenting implemented features for student management, course management, student detail view, enrollment interface, and visual design theme with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality, including pages, components, hooks, and styling configurations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, trustworthy education-themed color system using OKLCH color space for both light and dark modes.",
  "frontend/index.html": "HTML entry point for the React application with title 'LORDSON Edu' and root div mounting point.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, students, courses, and detail pages, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/AddCourseDialog.tsx": "Dialog component with form for creating new courses, collecting course name, code, description, credit hours, and professor with validation and mutation handling.",
  "frontend/src/components/AddStudentDialog.tsx": "Dialog component with form for creating new student profiles, collecting full name, date of birth, and grade level with StudentStatus enum integration and validation.",
  "frontend/src/components/CourseList.tsx": "Displays a table of all courses with navigation to course details and an 'Add Course' button that opens AddCourseDialog. Shows loading state and empty state with icon when no courses exist.",
  "frontend/src/components/EnrollStudentDialog.tsx": "Dialog component for enrolling a student in a course with dropdowns for student and course selection. Validates against duplicate enrollments and supports pre-selected student/course IDs.",
  "frontend/src/components/Layout.tsx": "Main application layout with header (logo, navigation links, login button), responsive mobile menu, footer, and profile setup dialog trigger. Wraps all page content.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog that prompts new users to enter their name for profile creation. Cannot be dismissed until profile is saved.",
  "frontend/src/components/StudentDetailView.tsx": "Displays detailed student information card and a table of enrolled courses with grades. Includes button to open enrollment dialog for adding new course enrollments.",
  "frontend/src/components/StudentList.tsx": "Displays a table of all students with navigation to student details and an 'Add Student' button that opens AddStudentDialog. Shows loading state and empty state when no students exist.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance for backend communication, invalidating dependent queries when the actor changes based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all CRUD operations on students, courses, enrollments, and user profiles, with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm education-themed color palette for both light and dark modes, including primary blues, accent oranges, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CourseDetailPage.tsx": "Displays detailed course information and enrolled students table with enrollment management, requiring authentication and fetching course data by courseId from route params.",
  "frontend/src/pages/CoursesPage.tsx": "Simple page component that renders the CourseList component for authenticated users or shows a login prompt.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and feature cards linking to student and course management sections, with conditional rendering based on authentication status.",
  "frontend/src/pages/StudentDetailPage.tsx": "Page component that displays detailed information for a single student by ID, with authentication checks, loading states, error handling, and navigation back to the student list.",
  "frontend/src/pages/StudentsPage.tsx": "Page component that renders the student list view with authentication guard, showing an alert if user is not logged in.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography, animations, and design tokens for the education platform UI.",
  "project_state.json": "Project metadata tracking the multi-tenant education platform's architecture, completed features (student/course management interfaces), pending feature requests (role-based dashboards, staff directories), and design requirements."
}